/******************** (C) COPYRIGHT 2013 www.armjishu.com  ********************
 * 文件名  ：ST_ICON.c
 * 描述    ：ST的LOGO灰度二值图片数据库。
 * 实验平台：STM32神舟开发板
 * 标准库  ：STM32F10x_StdPeriph_Driver V3.5.0
 * 作者    ：www.armjishu.com 
*******************************************************************************/
/*
Image2Lcd保存的图像数据组织方式为：图像头数据-调色板数据-图像数据。

“4096色/16位真彩色/18位真彩色/24位真彩色/32位真彩色”的图像数据头如下：

typedef struct _HEADCOLOR
{
   unsigned char scan;
   unsigned char gray;
   unsigned short w;
   unsigned short h;
   unsigned char is565;
   unsigned char rgb;
}HEADCOLOR; 

scan: 扫描模式 

Bit7: 0:自左至右扫描，1:自右至左扫描。 
Bit6: 0:自顶至底扫描，1:自底至顶扫描。 
Bit5: 0:字节内象素数据从高位到低位排列，1:字节内象素数据从低位到高位排列。 
Bit4: 0:WORD类型高低位字节顺序与PC相同，1:WORD类型高低位字节顺序与PC相反。 
Bit3~2: 保留。 
Bit1~0: [00]水平扫描，[01]垂直扫描，[10]数据水平,字节垂直，[11]数据垂直,字节水平。 
gray: 灰度值 
   灰度值，1:单色，2:四灰，4:十六灰，8:256色，12:4096色，16:16位彩色，24:24位彩色，32:32位彩色。


w: 图像的宽度。

h: 图像的高度。

is565: 在4096色模式下为0表示使用[16bits(WORD)]格式，此时图像数据中每个WORD表示一个象素；为1表示使用[12bits(连续字节流)]格式，此时连续排列的每12Bits代表一个象素。
在16位彩色模式下为0表示R G B颜色分量所占用的位数都为5Bits，为1表示R G B颜色分量所占用的位数分别为5Bits,6Bits,5Bits。
在18位彩色模式下为0表示"6Bits in Low Byte"，为1表示"6Bits in High Byte"。
在24位彩色和32位彩色模式下is565无效。

rgb: 描述R G B颜色分量的排列顺序，rgb中每2Bits表示一种颜色分量，[00]表示空白，[01]表示Red，[10]表示Green，[11]表示Blue。

“256色”的调色板数据结构如下：

typedef struct _PALENTRY
{
   unsigned char red;
   unsigned char green;
   unsigned char blue;
}PALENTRY;

typedef struct _PALETTE
{
   unsigned short palnum;
   PALENTRY palentry[palnum];
}PALETTE;


仅在256色模式下存在调色板数据结构,调色板数据结构紧跟在数据结构HEADGRAY之后。
*/
#include "ST_ICON.h"

const unsigned char gImage_ST_ICON[262] = { 0X00,0X01,0X3B,0X00,0X20,0X00,
0X00,0X03,0XFF,0XFF,0XFF,0XFF,0XFF,0XE0,0X00,0X03,0XFF,0XFF,0XFF,0XFF,0XFF,0XC0,
0X00,0X07,0XFF,0XFF,0XFF,0XFF,0XFF,0XC0,0X00,0X07,0XFF,0XFF,0XFF,0XFF,0XFF,0X80,
0X00,0X0F,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X0E,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X1C,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X18,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X30,0X1F,0XFF,0XFF,0X03,0XFE,0X00,0X00,0X30,0X3F,0XFF,0XFF,0X03,0XFE,0X00,
0X00,0X70,0X3F,0XFF,0XFE,0X07,0XFC,0X00,0X00,0X70,0X3F,0XFF,0XFE,0X07,0XFC,0X00,
0X00,0XF8,0X1F,0XFF,0XFC,0X0F,0XF8,0X00,0X00,0XF8,0X0F,0XFF,0XFC,0X0F,0XF8,0X00,
0X01,0XFC,0X07,0XFF,0XF8,0X1F,0XF0,0X00,0X01,0XFE,0X03,0XFF,0XF8,0X1F,0XF0,0X00,
0X03,0XFF,0X01,0XFF,0XF0,0X3F,0XE0,0X00,0X03,0XFF,0X80,0XFF,0XF0,0X3F,0XE0,0X00,
0X07,0XFF,0XC0,0X7F,0XE0,0X7F,0XC0,0X00,0X07,0XFF,0XE0,0X3F,0XE0,0X7F,0XC0,0X00,
0X0F,0XFF,0XF0,0X1F,0XC0,0XFF,0X80,0X00,0X0F,0XFF,0XF8,0X0F,0XC0,0XFF,0X80,0X00,
0X1F,0XFF,0XFC,0X0F,0X81,0XFF,0X00,0X00,0X1F,0XFF,0XFE,0X0F,0X81,0XFF,0X00,0X00,
0X3F,0XFF,0XFE,0X0F,0X03,0XFE,0X00,0X00,0X3F,0XFF,0XFE,0X0F,0X03,0XFE,0X00,0X00,
0X7F,0XFF,0XFC,0X0E,0X07,0XFC,0X00,0X00,0X00,0X00,0X00,0X1E,0X07,0XFC,0X00,0X00,
0X00,0X00,0X00,0X1C,0X0F,0XF8,0X00,0X00,0X00,0X00,0X00,0X3C,0X0F,0XF8,0X00,0X00,
0X00,0X00,0X00,0X78,0X1F,0XF0,0X00,0X00,0XFF,0XFF,0XFF,0XFF,0XFF,0XF0,0X00,0X00,
};
/*
               *********************************************
               ******************************************** 
              ********************************************* 
              ********************************************  
             ****                                           
             ***                                            
            ***                                             
            **                                              
           **       *********************      *********    
           **      **********************      *********    
          ***      *********************      *********     
          ***      *********************      *********     
         *****      *******************      *********      
         *****       ******************      *********      
        *******       ****************      *********       
        ********       ***************      *********       
       **********       *************      *********        
       ***********       ************      *********        
      *************       **********      *********         
      **************       *********      *********         
     ****************       *******      *********          
     *****************       ******      *********          
    *******************      *****      *********           
    ********************     *****      *********           
   *********************     ****      *********            
   *********************     ****      *********            
  *********************      ***      *********             
                            ****      *********             
                            ***      *********              
                           ****      *********              
                          ****      *********               
 ******************************************** 
*/

/*******************  (C) COPYRIGHT 2013 www.armjishu.com  *****END OF FILE****/
